; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	image1 - mode
	image2 - mode
	infrared3 - mode
	thermograph0 - mode
	Star5 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation8 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star7 - direction
	GroundStation10 - direction
	Star11 - direction
	Star9 - direction
	GroundStation1 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star7)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 GroundStation8)
	(supports instrument3 image1)
	(supports instrument3 image2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star9)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 image1)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared3)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared3)
	(supports instrument6 image1)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 GroundStation10)
	(calibration_target instrument6 Star7)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument7 infrared3)
	(supports instrument7 image2)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation8)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite2 GroundStation8)
	(pointing satellite3 GroundStation10)
	(have_image Planet12 image1)
	(have_image Star13 infrared3)
	(have_image Phenomenon14 infrared3)
))

)

; plan
1. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 6
2. (calibrate satellite3 instrument6 star7)
   added: (calibrated instrument6)
   goals met: 0 of 6
3. (turn_to satellite3 planet12 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet12)
   goals met: 0 of 6
4. (take_image satellite3 planet12 instrument6 image1)
   added: (have_image planet12 image1)
   goals met: 1 of 6
5. (turn_to satellite3 phenomenon14 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon14)
   goals met: 1 of 6
6. (turn_to satellite0 groundstation0 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 6
7. (take_image satellite3 phenomenon14 instrument6 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 3 of 6
8. (turn_to satellite2 groundstation8 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 groundstation8)
   goals met: 4 of 6
9. (turn_to satellite3 star13 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star13)
   goals met: 4 of 6
10. (take_image satellite3 star13 instrument6 infrared3)
   added: (have_image star13 infrared3)
   goals met: 5 of 6
11. (turn_to satellite3 groundstation10 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 groundstation10)
   goals met: 6 of 6
